{
  "title": "Set Yourself Up for Success",
  "speaker": "Dr. Leif Stromberg",
  "releaseDate": "4/5/2024",
  "description": "This course focuses on essential elements of the consultation/examination appointment for enhancing the predictability and success of complete denture fabrication. It breaks down this initial appointment into three phases: preexamination consultation, clinical edentulous examination and postexamination consultation. • In the preexamination consultation phase, the emphasis is on actively listening to the patient. Understanding their previous experiences with dentures, their adaptability to prostheses, and their specific desires and expectations for new dentures is essential. • The clinical examination involves an assessment of the patient’s oral conditions. This helps determine their restorative needs in alignment with their desires and expectations. The dentist evaluates oral health, anatomy and factors that may affect the success of the dentures, such as stability of the temporomandibular joints and potential airway obstructions. • The final phase, the postexamination consultation, includes a discussion of the findings from the consultation and examination. Here, various options and recommendations are presented, tailored to the patient’s individual needs, wants and expectations. Additionally, a comprehensive informed consent process is crucial and should cover all treatment options and their benefits, risks and associated costs to ensure transparency and foster patient compliance.",
  "educationalObjectives": "Conduct a preexamination consultation that establishes open communication and patient rapport, leading to a better understanding of patient wants and expectations.\nProvide a practical clinical edentulous examination, including evaluating the patient’s oral health and identifying anatomic factors influencing denture success to determine the patient’s needs.\nDiscuss the importance of patient-centered care, including: active listening and empathetic communication to create a comfortable environment where patients can express their wants, expectations and concerns; and incorporating information from the findings of the clinical examination to perform appropriate treatment.\nConduct a thorough informed consent process, including a discussion of treatment options, risks, benefits and fees, and the recognition of the patient's right to choose no treatment."
}
